import numpy as np

# Вариант 20
# Матрица коэффициентов системы
a = np.array([
    [4.59, 4.83, 4.06],
    [4.24, 4.36, 3.53],
    [3.82, 3.88, 3.01]
])

# Столбец свободных членов
b = np.array([
    [59.54],
    [62.33],
    [52.11]
])

# Данные для тестов. Ответ: x_1 = -0.5; x_2 = 1; x_3 = 0.5
# Матрица коэффициентов системы
a_test = np.array([
    [2., 1., 2.],
    [1., 1., 1.],
    [1., 1., 3.]
])

# Столбец свободных членов
b_test = np.array([
    [1.],
    [1.],
    [2.]
])

# Вариант 5
a_test2 = np.array([
    [1.53, 1.61, 1.43],
    [2.35, 2.31, 2.07],
    [3.83, 3.73, 3.45]
])

b_test2 = np.array([
    [-5.13],
    [-3.69],
    [-5.98]
])
